![png](Data/movies-erd.png)

In [1]:
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()

import pandas as pd

In [3]:
# create sqlalchemy engine and connection
username = "root"
password = "root"
db_name = "movies"

connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

engine = create_engine(connection)

conn = engine.connect()

In [4]:
# run query to show all tables
q = """
    SHOW TABLES;
    """
pd.read_sql(q, conn)

          Tables_in_movies
0                   genres
1                  ratings
2             title_basics
3  title_basics_has_genres

In [10]:
# use DESCRIBE table command to display genres column details

q = """
    DESCRIBE genres;
    """
describe = pd.read_sql(q, conn)

describe

        Field         Type Null  Key Default           Extra
0    genre_id          int   NO  PRI    None  auto_increment
1  genre_name  varchar(45)  YES         None

In [11]:
# use DESCRIBE table command to display ratings column details

q = """
    DESCRIBE ratings;
    """
describe = pd.read_sql(q, conn)

describe

                 Field         Type Null  Key Default Extra
0               tconst  varchar(10)   NO  PRI    None
1       average_rating        float  YES         None
2      number_of_votes          int  YES         None
3  title_basics_tconst  varchar(10)  YES         None

In [12]:
# use DESCRIBE table command to display title_basics column details

q = """
    DESCRIBE title_basics;
    """
describe = pd.read_sql(q, conn)

describe

           Field          Type Null  Key Default Extra
0         tconst   varchar(10)   NO  PRI    None
1  primary_title  varchar(242)  YES         None
2     start_year          year  YES         None
3        runtime           int  YES         None

In [13]:
# use DESCRIBE table command to display title_basics_has_genres column details

q = """
    DESCRIBE genres;
    """
describe = pd.read_sql(q, conn)

describe

        Field         Type Null  Key Default           Extra
0    genre_id          int   NO  PRI    None  auto_increment
1  genre_name  varchar(45)  YES         None

In [14]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection

q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)

In [21]:
# import tables from CSV files

ratings = pd.read_csv('Data/ratings.csv')
title_basics = pd.read_csv('Data/basics.csv')

       Unnamed: 0     tconst  averageRating  numVotes
0           17961  tt0035423            6.4     87153
1           40764  tt0062336            6.4       175
2           46645  tt0069049            6.7      7754
3           63640  tt0088751            5.2       336
4           69953  tt0096056            5.6       846
...           ...        ...            ...       ...
71895     1331411  tt9914942            6.6       178
71896     1331437  tt9915872            6.4         9
71897     1331450  tt9916170            7.0         7
71898     1331451  tt9916190            3.7       243
71899     1331462  tt9916362            6.4      5422

[71900 rows x 4 columns]

In [ ]:
# import tables from CSV files

# users = pd.read_csv('Data/users.csv')
# books = pd.read_csv('Data/books.csv')
# favorites = pd.read_csv('Data/favorites.csv')
# authors = pd.read_csv('Data/authors.csv')

In [ ]:
# # query to view and compare tables' datatypes with df datatypes
# q = """
#     DESCRIBE users;
#     """
# describe = pd.read_sql(q, conn)

# describe['Field'].values